food/app/Models/UsuarioModel.php

    public function procurar($term) {

        if ($term == null) {
            return [];
    }

    return $this->select('id, nome')
        ->like('nome',$term)
        ->get()
        ->getResult();
---
SELECT `id`, `nome`
FROM `usuarios`
WHERE `nome` LIKE '%mar%' ESCAPE '!'