ci4_crud/app/Controllers/Crud/Inicio.php

SELECT *
FROM `usuarios`
ORDER BY `id`
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
---
    public function index()
    {
        $data = [
            'var_users' => $this->usuarios->orderby('id', 'nome')->paginate(3), //aqui foi jogado todo os dados na variavel users
            'pagina' => $this->usuarios->pager, //essa variavel vai recer os links de pagina
        ];

INSERT INTO `usuarios` (`nome`, `descricao`) VALUES ('carosso', 'osso')
---
    public function criarNovoRegistro()
    {
        //**********Criando uma lista com os dados capturados********* */
        $lista_de_dados = [
            'nome' => $_POST['user_name'],
            'descricao' => $_POST['user_description']
        ];
        //************************************************************* */
        //**************Salvando no Banco de dados********************* */
        if ($this->usuarios->save($lista_de_dados)) {